In [68]:
import numpy as np
import pandas as pd

In [69]:
movies=pd.read_csv("tmdb_5000_movies.csv")
credits=pd.read_csv("tmdb_5000_credits.csv")

In [70]:
movies.head(1)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800

In [71]:
credits.head(1)

,movie_id,title,cast,crew
0,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."

In [72]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4803 entries, 0 to 4802
Data columns (total 20 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   budget                4803 non-null   int64
 1   genres                4803 non-null   object
 2   homepage              1712 non-null   object
 3   id                    4803 non-null   int64
 4   keywords              4803 non-null   object
 5   original_language     4803 non-null   object
 6   original_title        4803 non-null   object
 7   overview              4800 non-null   object
 8   popularity            4803 non-null   float64
 9   production_companies  4803 non-null   object
 10  production_countries  4803 non-null   object
 11  release_date          4802 non-null   object
 12  revenue               4803 non-null   int64
 13  runtime               4801 non-null   float64
 14  spoken_languages      4803 non-null   object
 15  status                4803 non-null   object
 16  tagline               3959 non-null   object
 17  title                 4803 non-null   object
 18  vote_average          4803 non-null   float64
 19  vote_count            4803 non-null   int64
dtypes: float64(3), int64(4), object(13)
memory usage: 750.6+ KB

In [73]:
movies=movies[["id","genres","keywords","overview","title"]]

In [74]:
movies.head(1)

,id,genres,keywords,overview,title
0,19995,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...","[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...","In the 22nd century, a paraplegic Marine is di...",Avatar

In [75]:
credits.head(1)

,movie_id,title,cast,crew
0,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."

In [76]:
movies=movies.merge(credits,on="title")

In [77]:
movies.head(1)

,id,genres,keywords,overview,title,movie_id,cast,crew
0,19995,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...","[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...","In the 22nd century, a paraplegic Marine is di...",Avatar,19995,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."

In [78]:
movies.drop("movie_id",axis=1,inplace=True)

In [79]:
movies.head(1)

,id,genres,keywords,overview,title,cast,crew
0,19995,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...","[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...","In the 22nd century, a paraplegic Marine is di...",Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."

In [80]:
movies=movies[["id","title","genres","overview","cast","keywords","crew"]]

In [81]:
movies.head(1)

,id,title,genres,overview,cast,keywords,crew
0,19995,Avatar,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...","In the 22nd century, a paraplegic Marine is di...","[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."

In [82]:
movies.isnull().sum()

id          0
title       0
genres      0
overview    3
cast        0
keywords    0
crew        0
dtype: int64

In [83]:
movies.dropna(inplace=True)

In [84]:
import ast

In [85]:
def convert(text):
    L=[]
    for i in ast.literal_eval(text):
        L.append(i["name"])
    return L

In [86]:
movies["genres"]=movies["genres"].apply(convert)
movies["keywords"]=movies["keywords"].apply(convert)

In [87]:
movies.head(1)

,id,title,genres,overview,cast,keywords,crew
0,19995,Avatar,"[Action, Adventure, Fantasy, Science Fiction]","In the 22nd century, a paraplegic Marine is di...","[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[culture clash, future, space war, space colon...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."

In [88]:
def convert3(text):
    l=[]
    counter=0
    for i in ast.literal_eval(text):
        if counter < 3:
            l.append(i["name"])
        counter+=1
    return l

In [89]:
movies["cast"]=movies["cast"].apply(convert3)

In [90]:
def director(x):
    L=[]
    for i in ast.literal_eval(x):
        if i["job"] == "Director":
            L.append(i["name"])
    return L

In [91]:
movies["crew"]=movies["crew"].apply(convert)

In [92]:
movies.head(1)

,id,title,genres,overview,cast,keywords,crew
0,19995,Avatar,"[Action, Adventure, Fantasy, Science Fiction]","In the 22nd century, a paraplegic Marine is di...","[Sam Worthington, Zoe Saldana, Sigourney Weaver]","[culture clash, future, space war, space colon...","[Stephen E. Rivkin, Rick Carter, Christopher B..."

In [93]:
def collapse(x):
    L=[]
    for i in x:
        L.append(i.replace(" ",""))
    return L

In [94]:
movies["genres"]=movies["genres"].apply(collapse)
movies["cast"]=movies["cast"].apply(collapse)
movies["keywords"]=movies["keywords"].apply(collapse)
movies["crew"]=movies["crew"].apply(collapse)

In [95]:
movies.head(1)

,id,title,genres,overview,cast,keywords,crew
0,19995,Avatar,"[Action, Adventure, Fantasy, ScienceFiction]","In the 22nd century, a paraplegic Marine is di...","[SamWorthington, ZoeSaldana, SigourneyWeaver]","[cultureclash, future, spacewar, spacecolony, ...","[StephenE.Rivkin, RickCarter, ChristopherBoyes..."

In [96]:
movies["overview"][0]

'In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.'

In [97]:
movies["overview"]=movies["overview"].apply(lambda x:x.split())

In [98]:
movies["overview"][0];

In [99]:
movies["tags"]=movies["genres"]+movies["overview"]+movies["cast"]+movies["crew"]+movies["keywords"]

In [100]:
movies.drop(columns=["genres","overview","cast","crew","keywords"],inplace=True)

In [101]:
movies["tags"]=movies["tags"].apply(lambda x:" ".join(x))

In [104]:
movies.head(1)

      id   title                                               tags
0  19995  Avatar  Action Adventure Fantasy ScienceFiction In the...

In [105]:
movies["tags"]=movies["tags"].apply(lambda x:x.lower())

In [106]:
movies.head(1)

      id   title                                               tags
0  19995  Avatar  action adventure fantasy sciencefiction in the...

In [107]:
from sklearn.feature_extraction.text import CountVectorizer
cv=CountVectorizer(max_features=5000,stop_words="english")

In [108]:
vector=cv.fit_transform(movies["tags"]).toarray()

In [110]:
vector.shape

(4806, 5000)

In [115]:
cv.get_feature_names_out()

array(['000', '10', '11', ..., 'zoo', 'zooeydeschanel', 'zupancic'],
      dtype=object)